scripts/load-results-with-connection-pooling.txt
Running 30s test @ https://127.0.0.1:8080/api/files
  2 threads and 10 connections
  Thread calibration: mean lat.: 3.414ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.744ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.15ms  775.25us  14.75ms   81.92%
    Req/Sec     1.05k   169.45     2.00k    81.08%
  59982 requests in 30.00s, 96.22MB read
Requests/sec:   1999.17
Transfer/sec:      3.21MB